STMicroelectronics/trusted-firmware-m/platform/ext/target/stm/common/stm32mp2/native_driver/include/dt-bindings/clock/stm32mp2-clks.h
/* SPDX-License-Identifier: GPL-2.0 or BSD-3-Clause */
/*
 * Copyright (C) STMicroelectronics 2019 - All Rights Reserved
 * Author: Gabriel Fernandez <gabriel.fernandez@st.com> for STMicroelectronics.
 */

#ifndef DT_BINDINGS_STM32MP2_CLKS_H
#define DT_BINDINGS_STM32MP2_CLKS_H

/* INTERNAL/EXTERNAL OSCILLATORS */
#define HSI_CK			0
#define HSE_CK			1
#define CSI_CK			2
#define LSI_CK			3
#define LSE_CK			4
#define I2S_CK			5
#define RTC_CK			6
#define SPDIF_CK_SYMB		7

/* PLL CLOCKS */
#define PLL1_CK			8
#define PLL2_CK			9
#define PLL3_CK			10
#define PLL4_CK			11
#define PLL5_CK			12
#define PLL6_CK			13
#define PLL7_CK			14
#define PLL8_CK			15

/* LOW SPEEP MCU CLOCK */
#define CK_ICN_LS_MCU		20

/* APB DIV CLOCKS */
#define CK_ICN_APB1		21
#define CK_ICN_APB2		22
#define CK_ICN_APB3		23
#define CK_ICN_APB4		24
#define CK_ICN_APBDBG		25

/* GLOBAL TIMER */
#define TIMG1_CK		26
#define TIMG2_CK		27

/* FLEXGEN CLOCKS */
#define CK_ICN_HS_MCU		28
#define CK_ICN_SDMMC		29
#define CK_ICN_DDR		30
#define CK_ICN_DISPLAY		31
#define CK_ICN_HSL		32
#define CK_ICN_NIC		33
#define CK_ICN_VID		34

#define CK_FLEXGEN_07		35
#define CK_FLEXGEN_08		36
#define CK_FLEXGEN_09		37
#define CK_FLEXGEN_10		38
#define CK_FLEXGEN_11		39
#define CK_FLEXGEN_12		40
#define CK_FLEXGEN_13		41
#define CK_FLEXGEN_14		42
#define CK_FLEXGEN_15		43
#define CK_FLEXGEN_16		44
#define CK_FLEXGEN_17		45
#define CK_FLEXGEN_18		46
#define CK_FLEXGEN_19		47
#define CK_FLEXGEN_20		48
#define CK_FLEXGEN_21		49
#define CK_FLEXGEN_22		50
#define CK_FLEXGEN_23		51
#define CK_FLEXGEN_24		52
#define CK_FLEXGEN_25		53
#define CK_FLEXGEN_26		54
#define CK_FLEXGEN_27		55
#define CK_FLEXGEN_28		56
#define CK_FLEXGEN_29		57
#define CK_FLEXGEN_30		58
#define CK_FLEXGEN_31		59
#define CK_FLEXGEN_32		60
#define CK_FLEXGEN_33		61
#define CK_FLEXGEN_34		62
#define CK_FLEXGEN_35		63
#define CK_FLEXGEN_36		64
#define CK_FLEXGEN_37		65
#define CK_FLEXGEN_38		66
#define CK_FLEXGEN_39		67
#define CK_FLEXGEN_40		68
#define CK_FLEXGEN_41		69
#define CK_FLEXGEN_42		70
#define CK_FLEXGEN_43		71
#define CK_FLEXGEN_44		72
#define CK_FLEXGEN_45		73
#define CK_FLEXGEN_46		74
#define CK_FLEXGEN_47		75
#define CK_FLEXGEN_48		76
#define CK_FLEXGEN_49		77
#define CK_FLEXGEN_50		78
#define CK_FLEXGEN_51		79
#define CK_FLEXGEN_52		80
#define CK_FLEXGEN_53		81
#define CK_FLEXGEN_54		82
#define CK_FLEXGEN_55		83
#define CK_FLEXGEN_56		84
#define CK_FLEXGEN_57		85
#define CK_FLEXGEN_58		86
#define CK_FLEXGEN_59		87
#define CK_FLEXGEN_60		88
#define CK_FLEXGEN_61		89
#define CK_FLEXGEN_62		90
#define CK_FLEXGEN_63		91

#define CK_BUS_STM500		92
#define CK_BUS_FMC		93
#define CK_BUS_GPU		94
#define CK_BUS_ETH1		95
#define CK_BUS_ETH2		96
#define CK_BUS_PCIE		97
#define CK_BUS_DDRPHYC		98
#define CK_BUS_SYSCPU1		99
#define CK_BUS_ETHSW		100
#define CK_BUS_HPDMA1		101
#define CK_BUS_HPDMA2		102
#define CK_BUS_HPDMA3		103
#define CK_BUS_ADC12		104
#define CK_BUS_ADC3		105
#define CK_BUS_IPCC1		106
#define CK_BUS_CCI		107
#define CK_BUS_CRC		108
#define CK_BUS_MDF1		109
#define CK_BUS_OSPIIOM		110
#define CK_BUS_BKPSRAM		111
#define CK_BUS_HASH		112
#define CK_BUS_RNG		113
#define CK_BUS_CRYP1		114
#define CK_BUS_CRYP2		115
#define CK_BUS_SAES		116
#define CK_BUS_PKA		117
#define CK_BUS_RISAF1		118
#define CK_BUS_RISAF5		119
#define CK_BUS_RISAB1		120
#define CK_BUS_RISAB2		121
#define CK_BUS_RISAB6		122
#define CK_BUS_GPIOA		123
#define CK_BUS_GPIOB		124
#define CK_BUS_GPIOC		125
#define CK_BUS_GPIOD		126
#define CK_BUS_GPIOE		127
#define CK_BUS_GPIOF		128
#define CK_BUS_GPIOG		129
#define CK_BUS_GPIOH		130
#define CK_BUS_GPIOI		131
#define CK_BUS_GPIOJ		132
#define CK_BUS_GPIOK		133
#define CK_BUS_LPSRAM1		134
#define CK_BUS_LPSRAM2		135
#define CK_BUS_LPSRAM3		136
#define CK_BUS_GPIOZ		137
#define CK_BUS_LPDMA		138
#define CK_BUS_ADF1		139
#define CK_BUS_HSEM		140
#define CK_BUS_IPCC2		141
#define CK_BUS_C3H		142
#define CK_BUS_C3S		143
#define CK_BUS_C3D		144
#define CK_BUS_RTC		145
#define CK_BUS_SPI8		146
#define CK_BUS_LPUART1		147
#define CK_BUS_I2C8		148
#define CK_BUS_LPTIM3		149
#define CK_BUS_LPTIM4		150
#define CK_BUS_LPTIM5		151
#define CK_BUS_IWDG5		152
#define CK_BUS_WWDG2		153
#define CK_BUS_I3C4		154
#define CK_BUS_TIM2		155
#define CK_BUS_TIM3		156
#define CK_BUS_TIM4		157
#define CK_BUS_TIM5		158
#define CK_BUS_TIM6		159
#define CK_BUS_TIM7		160
#define CK_BUS_TIM10		161
#define CK_BUS_TIM11		162
#define CK_BUS_TIM12		163
#define CK_BUS_TIM13		164
#define CK_BUS_TIM14		165
#define CK_BUS_LPTIM1		166
#define CK_BUS_LPTIM2		167
#define CK_BUS_SPI2		168
#define CK_BUS_SPI3		169
#define CK_BUS_SPDIFRX		170
#define CK_BUS_USART2		171
#define CK_BUS_USART3		172
#define CK_BUS_UART4		173
#define CK_BUS_UART5		174
#define CK_BUS_I2C1		175
#define CK_BUS_I2C2		176
#define CK_BUS_I2C3		177
#define CK_BUS_I2C4		178
#define CK_BUS_I2C5		179
#define CK_BUS_I2C6		180
#define CK_BUS_I2C7		181
#define CK_BUS_I3C1		182
#define CK_BUS_I3C2		183
#define CK_BUS_I3C3		184
#define CK_BUS_TIM1		185
#define CK_BUS_TIM8		186
#define CK_BUS_TIM15		187
#define CK_BUS_TIM16		188
#define CK_BUS_TIM17		189
#define CK_BUS_TIM20		190
#define CK_BUS_SAI1		191
#define CK_BUS_SAI2		192
#define CK_BUS_SAI3		193
#define CK_BUS_SAI4		194
#define CK_BUS_USART1		195
#define CK_BUS_USART6		196
#define CK_BUS_UART7		197
#define CK_BUS_UART8		198
#define CK_BUS_UART9		199
#define CK_BUS_FDCAN		200
#define CK_BUS_SPI1		201
#define CK_BUS_SPI4		202
#define CK_BUS_SPI5		203
#define CK_BUS_SPI6		204
#define CK_BUS_SPI7		205
#define CK_BUS_BSEC		206
#define CK_BUS_IWDG1		207
#define CK_BUS_IWDG2		208
#define CK_BUS_IWDG3		209
#define CK_BUS_IWDG4		210
#define CK_BUS_WWDG1		211
#define CK_BUS_VREF		212
#define CK_BUS_TMPSENS		213
#define CK_BUS_SERC		214
#define CK_BUS_HDP		215
#define CK_BUS_IS2M		216
#define CK_BUS_DSI		217
#define CK_BUS_LTDC		218
#define CK_BUS_CSI2		219
#define CK_BUS_DCMIPP		220
#define CK_BUS_DDRC		221
#define CK_BUS_DDRCFG		222
#define CK_BUS_LDIT		223
#define CK_BUS_GICV2M		224
#define CK_BUS_USBTC		225
#define CK_BUS_BUSPERFM		226
#define CK_BUS_USB3PCIEPHY	227
#define CK_BUS_STGEN		228
#define CK_BUS_VDEC		229
#define CK_BUS_VENC		230
#define CK_BUS_DBG		231
#define CK_KER_TIM2		232
#define CK_KER_TIM3		233
#define CK_KER_TIM4		234
#define CK_KER_TIM5		235
#define CK_KER_TIM6		236
#define CK_KER_TIM7		237
#define CK_KER_TIM10		238
#define CK_KER_TIM11		239
#define CK_KER_TIM12		240
#define CK_KER_TIM13		241
#define CK_KER_TIM14		242
#define CK_KER_TIM1		243
#define CK_KER_TIM8		244
#define CK_KER_TIM15		245
#define CK_KER_TIM16		246
#define CK_KER_TIM17		247
#define CK_KER_TIM20		248
#define CK_BUS_SYSRAM		249
#define CK_BUS_VDERAM		250
#define CK_BUS_RETRAM		251
#define CK_BUS_OSPI1		252
#define CK_BUS_OSPI2		253
#define CK_BUS_OTFD1		254
#define CK_BUS_OTFD2		255
#define CK_BUS_SRAM1		256
#define CK_BUS_SRAM2		257
#define CK_BUS_RISAB3		258
#define CK_BUS_RISAB4		259
#define CK_BUS_RISAB5		260
#define CK_BUS_SDMMC1		261
#define CK_BUS_SDMMC2		262
#define CK_BUS_SDMMC3		263
#define CK_BUS_DDR1		264
#define CK_BUS_DDR2		265
#define CK_BUS_USB2OHCI		268
#define CK_BUS_USB2EHCI		269
#define CK_BUS_USB3DRD		270
#define CK_KER_LPTIM1		273
#define CK_KER_LPTIM2		274
#define CK_KER_USART2		275
#define CK_KER_UART4		276
#define CK_KER_USART3		277
#define CK_KER_UART5		278
#define CK_KER_SPI2		279
#define CK_KER_SPI3		280
#define CK_KER_SPDIFRX		281
#define CK_KER_I2C1		282
#define CK_KER_I2C2		283
#define CK_KER_I3C1		284
#define CK_KER_I3C2		285
#define CK_KER_I2C3		286
#define CK_KER_I2C5		287
#define CK_KER_I3C3		288
#define CK_KER_I2C4		289
#define CK_KER_I2C6		290
#define CK_KER_I2C7		291
#define CK_KER_SPI1		292
#define CK_KER_SPI4		293
#define CK_KER_SPI5		294
#define CK_KER_SPI6		295
#define CK_KER_SPI7		296
#define CK_KER_USART1		297
#define CK_KER_USART6		298
#define CK_KER_UART7		299
#define CK_KER_UART8		300
#define CK_KER_UART9		301
#define CK_KER_MDF1		302
#define CK_KER_SAI1		303
#define CK_KER_SAI2		304
#define CK_KER_SAI3		305
#define CK_KER_SAI4		306
#define CK_KER_FDCAN		307
#define CK_KER_DSIBLANE		308
#define CK_KER_DSIPHY		309
#define CK_KER_CSI2		310
#define CK_KER_CSI2TXESC	311
#define CK_KER_CSI2PHY		312
#define CK_KER_LVDSPHY		313
#define CK_KER_STGEN		314
#define CK_KER_USB3PCIEPHY	315
#define CK_KER_USB3TC		316
#define CK_KER_I3C4		317
#define CK_KER_SPI8		318
#define CK_KER_I2C8		319
#define CK_KER_LPUART1		320
#define CK_KER_LPTIM3		321
#define CK_KER_LPTIM4		322
#define CK_KER_LPTIM5		323
#define CK_KER_ADF1		324
#define CK_KER_TSDBG		325
#define CK_KER_TPIU		326
#define CK_BUS_ETR		327
#define CK_BUS_ATB		328
#define CK_KER_ADC12		329
#define CK_KER_ADC3		330
#define CK_KER_OSPI1		331
#define CK_KER_OSPI2		332
#define CK_KER_FMC		333
#define CK_KER_SDMMC1		334
#define CK_KER_SDMMC2		335
#define CK_KER_SDMMC3		336
#define CK_KER_ETH1		337
#define CK_KER_ETH2		338
#define CK_KER_ETH1PTP		339
#define CK_KER_ETH2PTP		340
#define CK_KER_USB2PHY1		341
#define CK_KER_USB2PHY2		342
#define CK_KER_ETHSW		343
#define CK_KER_ETHSWREF		344
#define CK_MCO1			345
#define CK_MCO2			346
#define CK_KER_TMPSENS		347

#define CK_ETH1_RX		348
#define CK_ETH1_TX		349
#define CK_ETH1_MAC		350

#define CK_ETH2_RX		351
#define CK_ETH2_TX		352
#define CK_ETH2_MAC		353

#define CK_ETH1_STP		354
#define CK_ETH2_STP		355

#define STM32MP2_LAST_CLK	356

#define CK_SCMI0_ICN_HS_MCU	0
#define CK_SCMI0_ICN_SDMMC	1
#define CK_SCMI0_ICN_DDR	2
#define CK_SCMI0_ICN_DISPLAY	3
#define CK_SCMI0_ICN_HSL	4
#define CK_SCMI0_ICN_NIC	5
#define CK_SCMI0_ICN_VID	6
#define CK_SCMI0_FLEXGEN_07	7
#define CK_SCMI0_FLEXGEN_08	8
#define CK_SCMI0_FLEXGEN_09	9
#define CK_SCMI0_FLEXGEN_10	10
#define CK_SCMI0_FLEXGEN_11	11
#define CK_SCMI0_FLEXGEN_12	12
#define CK_SCMI0_FLEXGEN_13	13
#define CK_SCMI0_FLEXGEN_14	14
#define CK_SCMI0_FLEXGEN_15	15
#define CK_SCMI0_FLEXGEN_16	16
#define CK_SCMI0_FLEXGEN_17	17
#define CK_SCMI0_FLEXGEN_18	18
#define CK_SCMI0_FLEXGEN_19	19
#define CK_SCMI0_FLEXGEN_20	20
#define CK_SCMI0_FLEXGEN_21	21
#define CK_SCMI0_FLEXGEN_22	22
#define CK_SCMI0_FLEXGEN_23	23
#define CK_SCMI0_FLEXGEN_24	24
#define CK_SCMI0_FLEXGEN_25	25
#define CK_SCMI0_FLEXGEN_26	26
#define CK_SCMI0_FLEXGEN_27	27
#define CK_SCMI0_FLEXGEN_28	28
#define CK_SCMI0_FLEXGEN_29	29
#define CK_SCMI0_FLEXGEN_30	30
#define CK_SCMI0_FLEXGEN_31	31
#define CK_SCMI0_FLEXGEN_32	32
#define CK_SCMI0_FLEXGEN_33	33
#define CK_SCMI0_FLEXGEN_34	34
#define CK_SCMI0_FLEXGEN_35	35
#define CK_SCMI0_FLEXGEN_36	36
#define CK_SCMI0_FLEXGEN_37	37
#define CK_SCMI0_FLEXGEN_38	38
#define CK_SCMI0_FLEXGEN_39	39
#define CK_SCMI0_FLEXGEN_40	40
#define CK_SCMI0_FLEXGEN_41	41
#define CK_SCMI0_FLEXGEN_42	42
#define CK_SCMI0_FLEXGEN_43	43
#define CK_SCMI0_FLEXGEN_44	44
#define CK_SCMI0_FLEXGEN_45	45
#define CK_SCMI0_FLEXGEN_46	46
#define CK_SCMI0_FLEXGEN_47	47
#define CK_SCMI0_FLEXGEN_48	48
#define CK_SCMI0_FLEXGEN_49	49
#define CK_SCMI0_FLEXGEN_50	50
#define CK_SCMI0_FLEXGEN_51	51
#define CK_SCMI0_FLEXGEN_52	52
#define CK_SCMI0_FLEXGEN_53	53
#define CK_SCMI0_FLEXGEN_54	54
#define CK_SCMI0_FLEXGEN_55	55
#define CK_SCMI0_FLEXGEN_56	56
#define CK_SCMI0_FLEXGEN_57	57
#define CK_SCMI0_FLEXGEN_58	58
#define CK_SCMI0_FLEXGEN_59	59
#define CK_SCMI0_FLEXGEN_60	60
#define CK_SCMI0_FLEXGEN_61	61
#define CK_SCMI0_FLEXGEN_62	62
#define CK_SCMI0_FLEXGEN_63	63

#define CK_SCMI0_ICN_LS_MCU	64

#define CK_SCMI0_HSE		65
#define CK_SCMI0_LSE		66
#define CK_SCMI0_HSI		67
#define CK_SCMI0_LSI		68
#define CK_SCMI0_CSI		69

#define CK_SCMI0_RTC		70

#define CK_SCMI0_ICN_APB1	71
#define CK_SCMI0_ICN_APB2	72
#define CK_SCMI0_ICN_APB3	73
#define CK_SCMI0_ICN_APB4	74

#define CK_SCMI0_ICN_APBDBG	75

#define CK_SCMI0_TIMG1		76
#define CK_SCMI0_TIMG2		77

#endif /* DT_BINDINGS_STM32MP2_CLKS_H */
